
## Plan Result (terraform)

[CI link](https://github.com/naari3/bakatare-minna/actions/runs/7355572240)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_dns_managed_zone.bakatare
  * google_dns_record_set.a


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_dns_managed_zone.bakatare will be created
  + resource "google_dns_managed_zone" "bakatare" {
      + creation_time    = (known after apply)
      + description      = "Managed by Terraform"
      + dns_name         = "bakatare.naari3.net."
      + effective_labels = (known after apply)
      + force_destroy    = false
      + id               = (known after apply)
      + managed_zone_id  = (known after apply)
      + name             = "bakatare-zone"
      + name_servers     = (known after apply)
      + project          = "bakatare-minecraft"
      + terraform_labels = (known after apply)
      + visibility       = "public"
    }

  # google_dns_record_set.a will be created
  + resource "google_dns_record_set" "a" {
      + id           = (known after apply)
      + managed_zone = "bakatare-zone"
      + name         = "bakatare.naari3.net."
      + project      = "bakatare-minecraft"
      + rrdatas      = [
          + "34.42.86.231",
        ]
      + ttl          = 5
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"73b46043981e376cfda13df31bdcc9ed52699d18","Target":"terraform","Vars":{},"WorkflowName":"test"} -->